carbon-t-march-emdhg.log

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://context.app.fcr.iflex.com" xmlns:dto1="http://dto.global.app.fcr.iflex.com" xmlns:spi="http://spi.loans.app.fcr.iflex.com" xmlns:dto="http://dto.spi.loans.app.fcr.iflex.com">
    <soapenv:Body>
        <spi:createLoanAccountForIBOC>
            <spi:sessionContext>
                <con:postingDateText/>
                <con:bankCode>15</con:bankCode>
                <con:reason>
                    <con:comment/>
                    <con:reasonCode>0</con:reasonCode>
                </con:reason>
                <con:serviceCode/>
                <con:externalBatchNumber>0</con:externalBatchNumber>
                <con:supervisorContext>
                    <con:primaryPassword/>
                    <con:userId/>
                </con:supervisorContext>
                <con:channel>LOS</con:channel>
                <con:localDateTimeText/>
                <con:externalReferenceNo/>
                <con:userId>RLOS</con:userId>
                <con:originalReferenceNo/>
                <con:externalSystemAuditTrailNumber>0</con:externalSystemAuditTrailNumber>
                <con:overridenWarnings/>
                <con:transactionBranch>999</con:transactionBranch>
                <con:sessionTicket/>
                <con:valueDateText>20200501</con:valueDateText>
                <con:userReferenceNumber/>
            </spi:sessionContext>
            <spi:employerCode/>
            <spi:customerAndRelation>
                <dto1:customerId>22</dto1:customerId>
                <dto1:customerName/>
                <dto1:relation/>
            </spi:customerAndRelation>
            <spi:loanPaymentInstructions>
                <dto:arrearType>0</dto:arrearType>
                <dto:transferFromSavings>Y</dto:transferFromSavings>
                <dto:savingsAccountId>012205033923</dto:savingsAccountId>
                <dto:percentageSalaryToBeDrawnDown>0</dto:percentageSalaryToBeDrawnDown>
                <dto:drawDownOnSalaryCredit/>
            </spi:loanPaymentInstructions>
            <spi:loanDirectAccountDetails>
                <dto:branchCode>1</dto:branchCode>
                <dto:interestRate>14</dto:interestRate>
                <dto:loanTerm>60</dto:loanTerm>
                <dto:contribution>0</dto:contribution>
                <dto:customerRelation>SOW</dto:customerRelation>
                <dto:productCode>469</dto:productCode>
                <dto:customerId>0000743446</dto:customerId>
                <dto:loanPurpose>HITEM</dto:loanPurpose>
                <dto:scheduleCode>135</dto:scheduleCode>
                <dto:assetValue>10000000</dto:assetValue>
                <dto:repaymentMode>2</dto:repaymentMode>
                <dto:loanAmount>10000000</dto:loanAmount>
            </spi:loanDirectAccountDetails>
            <spi:flgRepaymentInstruction>Y</spi:flgRepaymentInstruction>
        </spi:createLoanAccountForIBOC>
    </soapenv:Body>
</soapenv:Envelope>